avr-rust/avrd/packs/xmegab/ATxmega128B1.atdf
        <module name="TC2" id="I6090" version="XMEGAD">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PC0"/>
              <signal function="TC2" group="LOC2B" pad="PC1"/>
              <signal function="TC2" group="LOC2C" pad="PC2"/>
              <signal function="TC2" group="LOC2D" pad="PC3"/>
              <signal function="TC2" group="HOC2A" pad="PC4"/>
              <signal function="TC2" group="HOC2B" pad="PC5"/>
              <signal function="TC2" group="HOC2C" pad="PC6"/>
              <signal function="TC2" group="HOC2D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCE2">
            <register-group address-space="data" offset="0xA00" name-in-module="TC2" name="TCE2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PE0"/>
              <signal function="TC2" group="LOC2B" pad="PE1"/>
              <signal function="TC2" group="LOC2C" pad="PE2"/>
              <signal function="TC2" group="LOC2D" pad="PE3"/>
              <signal function="TC2" group="HOC2A" pad="PE4"/>
              <signal function="TC2" group="HOC2B" pad="PE5"/>
              <signal function="TC2" group="HOC2C" pad="PE6"/>
              <signal function="TC2" group="HOC2D" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="AWEX" id="I6090" version="XMEGAAU">
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
            <signals>
              <signal function="AWEX" group="OC0ALS" pad="PC0"/>
              <signal function="AWEX" group="OC0AHS" pad="PC1"/>
              <signal function="AWEX" group="OC0BLS" pad="PC2"/>
              <signal function="AWEX" group="OC0BHS" pad="PC3"/>
              <signal function="AWEX" group="OC0CLS" pad="PC4"/>
              <signal function="AWEX" group="OC0CHS" pad="PC5"/>
              <signal function="AWEX" group="OC0DLS" pad="PC6"/>
              <signal function="AWEX" group="OC0DHS" pad="PC7"/>
            </signals>
          </instance>
        </module>
        <module name="HIRES" id="I6090" version="XMEGAAU">
          <instance name="HIRESC">
            <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
          </instance>
        </module>
        <module name="USART" id="I6090" version="XMEGAAU">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
            </signals>
          </instance>
          <instance name="USARTE0">
            <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PE1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PE2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PE3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PE5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PE6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="I6090" version="XMEGAAU">
          <instance name="SPIC">
            <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
            <signals>
              <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
              <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
              <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
              <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
            </signals>
          </instance>
        </module>
        <module name="IRCOM" id="I6090" version="XMEGAB">
          <instance name="IRCOM">
            <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
          </instance>
        </module>
        <module name="LCD" id="I3003">
          <instance name="LCD">
            <register-group address-space="data" offset="0x0D00" name-in-module="LCD" name="LCD"/>
            <signals>
              <signal function="LCD_SEG" group="SEG" index="39" pad="PG0"/>
              <signal function="LCD_SEG" group="SEG" index="38" pad="PG1"/>
              <signal function="LCD_SEG" group="SEG" index="37" pad="PG2"/>
              <signal function="LCD_SEG" group="SEG" index="36" pad="PG3"/>
              <signal function="LCD_SEG" group="SEG" index="35" pad="PG4"/>
              <signal function="LCD_SEG" group="SEG" index="34" pad="PG5"/>
              <signal function="LCD_SEG" group="SEG" index="33" pad="PG6"/>
              <signal function="LCD_SEG" group="SEG" index="32" pad="PG7"/>
              <signal function="LCD_SEG" group="SEG" index="31" pad="PM0"/>
              <signal function="LCD_SEG" group="SEG" index="30" pad="PM1"/>
              <signal function="LCD_SEG" group="SEG" index="29" pad="PM2"/>
              <signal function="LCD_SEG" group="SEG" index="28" pad="PM3"/>
              <signal function="LCD_SEG" group="SEG" index="27" pad="PM4"/>
              <signal function="LCD_SEG" group="SEG" index="26" pad="PM5"/>
              <signal function="LCD_SEG" group="SEG" index="25" pad="PM6"/>
              <signal function="LCD_SEG" group="SEG" index="24" pad="PM7"/>
              <signal function="LCD_SEG" group="SEG" index="23" pad="SEG23"/>
              <signal function="LCD_SEG" group="SEG" index="22" pad="SEG22"/>
              <signal function="LCD_SEG" group="SEG" index="21" pad="SEG21"/>
              <signal function="LCD_SEG" group="SEG" index="20" pad="SEG20"/>
              <signal function="LCD_SEG" group="SEG" index="19" pad="SEG19"/>
              <signal function="LCD_SEG" group="SEG" index="18" pad="SEG18"/>
              <signal function="LCD_SEG" group="SEG" index="17" pad="SEG17"/>
              <signal function="LCD_SEG" group="SEG" index="16" pad="SEG16"/>
              <signal function="LCD_SEG" group="SEG" index="15" pad="SEG15"/>
              <signal function="LCD_SEG" group="SEG" index="14" pad="SEG14"/>
              <signal function="LCD_SEG" group="SEG" index="13" pad="SEG13"/>
              <signal function="LCD_SEG" group="SEG" index="12" pad="SEG12"/>
              <signal function="LCD_SEG" group="SEG" index="11" pad="SEG11"/>
              <signal function="LCD_SEG" group="SEG" index="10" pad="SEG10"/>
              <signal function="LCD_SEG" group="SEG" index="9" pad="SEG9"/>
              <signal function="LCD_SEG" group="SEG" index="8" pad="SEG8"/>
              <signal function="LCD_SEG" group="SEG" index="7" pad="SEG7"/>
              <signal function="LCD_SEG" group="SEG" index="6" pad="SEG6"/>
              <signal function="LCD_SEG" group="SEG" index="5" pad="SEG5"/>
              <signal function="LCD_SEG" group="SEG" index="4" pad="SEG4"/>
              <signal function="LCD_SEG" group="SEG" index="3" pad="SEG3"/>
              <signal function="LCD_SEG" group="SEG" index="2" pad="SEG2"/>
              <signal function="LCD_SEG" group="SEG" index="1" pad="SEG1"/>
              <signal function="LCD_SEG" group="SEG" index="0" pad="SEG0"/>
              <signal function="LCD_BLINK" group="BLINK" index="1" pad="SEG1"/>
              <signal function="LCD_BLINK" group="BLINK" index="0" pad="SEG0"/>
              <signal function="LCD_BIAS" group="BIAS" index="1" pad="BIAS1"/>
              <signal function="LCD_BIAS" group="BIAS" index="2" pad="BIAS2"/>
              <signal function="LCD_BIAS" group="VLCD"  pad="VLCD"/>
              <signal function="LCD_BIAS" group="CAPL"  pad="CAPL"/>
              <signal function="LCD_BIAS" group="CAPH"  pad="CAPH"/>
              <signal function="LCD_COM" group="COM" index="0" pad="COM0"/>
              <signal function="LCD_COM" group="COM" index="1" pad="COM1"/>
              <signal function="LCD_COM" group="COM" index="2" pad="COM2"/>
              <signal function="LCD_COM" group="COM" index="3" pad="COM3"/>
              <signal function="LCD_COM_SWP" group="COM" index="0" pad="COM3"/>
              <signal function="LCD_COM_SWP" group="COM" index="1" pad="COM2"/>
              <signal function="LCD_COM_SWP" group="COM" index="2" pad="COM1"/>
              <signal function="LCD_COM_SWP" group="COM" index="3" pad="COM0"/>
            </signals>
          </instance>
        </module>
        <module name="FUSE" id="I6570" version="XMEGAAU">
          <instance name="FUSE">
            <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
