avr-rust/avrd/packs/xmegab/ATxmega128B1.atdf
        <register name="INTPRI" caption="Interrupt Priority" size="1" offset="0x01">
          <bitfield name="INTPRI" caption="Interrupt Priority" mask="0xFF"/>
        </register>
        <register name="CTRL" caption="Control Register" size="1" offset="0x02">
          <bitfield name="RREN" caption="Round-Robin Priority Enable" mask="0x80"/>
          <bitfield name="IVSEL" caption="Interrupt Vector Select" mask="0x40"/>
          <bitfield name="HILVLEN" caption="High Level Enable" mask="0x04"/>
          <bitfield name="MEDLVLEN" caption="Medium Level Enable" mask="0x02"/>
          <bitfield name="LOLVLEN" caption="Low Level Enable" mask="0x01"/>
        </register>
      </register-group>
    </module>
    <module name="PORTCFG" id="I6075" version="XMEGAB" caption="Port Configuration">
      <register-group caption="I/O port Configuration" name="PORTCFG" size="7">
        <register caption="Multi-pin Configuration Mask" name="MPCMASK" offset="0x00" size="1"/>
        <register caption="Virtual Port Control Register A" name="VPCTRLA" offset="0x02" size="1">
          <bitfield caption="Virtual Port 1 Mapping" mask="0xF0" name="VP1MAP" values="PORTCFG_VP13MAP"/>
          <bitfield caption="Virtual Port 0 Mapping" mask="0x0F" name="VP0MAP" values="PORTCFG_VP02MAP"/>
        </register>
        <register caption="Virtual Port Control Register B" name="VPCTRLB" offset="0x03" size="1">
          <bitfield caption="Virtual Port 3 Mapping" mask="0xF0" name="VP3MAP" values="PORTCFG_VP13MAP"/>
          <bitfield caption="Virtual Port 2 Mapping" mask="0x0F" name="VP2MAP" values="PORTCFG_VP02MAP"/>
        </register>
        <register caption="Clock and Event Out Register" name="CLKEVOUT" offset="0x04" size="1">
          <bitfield caption="Peripheral Clock Output Port" mask="0x03" name="CLKOUT" values="PORTCFG_CLKOUT"/>
          <bitfield caption="Peripheral Clock Output Select" mask="0x0C" name="CLKOUTSEL" values="PORTCFG_CLKOUTSEL"/>
          <bitfield caption="Event Output Port" mask="0x30" name="EVOUT" values="PORTCFG_EVOUT"/>
          <bitfield caption="RTC Clock Output" mask="0x40" name="RTCOUT"/>
          <bitfield caption="Peripheral Clock and Event Output pin Select" mask="0x80" name="CLKEVPIN" values="PORTCFG_CLKEVPIN"/>
        </register>
        <register caption="Event Output Select" name="EVOUTSEL" offset="0x06" size="1">
          <bitfield caption="Event Output Select" mask="0x04" name="EVOUTSEL" values="PORTCFG_EVOUTSEL"/>
        </register>
      </register-group>
      <value-group caption="Virtual Port Mapping" name="PORTCFG_VP02MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="Virtual Port Mapping" name="PORTCFG_VP13MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="System Clock Output Port" name="PORTCFG_CLKOUT">
        <value caption="System Clock Output Disabled" name="OFF" value="0x00"/>
        <value caption="System Clock Output on Port C" name="PC" value="0x01"/>
        <value caption="System Clock Output on Port E" name="PE" value="0x03"/>
      </value-group>
      <value-group caption="Peripheral Clock Output Select" name="PORTCFG_CLKOUTSEL">
        <value caption="1x Peripheral Clock Output to pin" name="CLK1X" value="0x00"/>
        <value caption="2x Peripheral Clock Output to pin" name="CLK2X" value="0x01"/>
        <value caption="4x Peripheral Clock Output to pin" name="CLK4X" value="0x02"/>
      </value-group>
      <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
        <value caption="Event Output Disabled" name="OFF" value="0x00"/>
        <value caption="Event Channel 0 Output on Port C" name="PC" value="0x01"/>
        <value caption="Event Channel 0 Output on Port E" name="PE" value="0x03"/>
      </value-group>
      <value-group caption="Clock and Event Output Port" name="PORTCFG_CLKEVPIN">
        <value caption="Clock and Event Ouput on PIN 7" name="PIN7" value="0x00"/>
        <value caption="Clock and Event Ouput on PIN 4" name="PIN4" value="0x01"/>
      </value-group>
      <value-group caption="Event Output Select" name="PORTCFG_EVOUTSEL">
        <value caption="Event Channel 0 output to pin" name="0" value="0x00"/>
        <value caption="Event Channel 1 output to pin" name="1" value="0x01"/>
        <value caption="Event Channel 2 output to pin" name="2" value="0x02"/>
        <value caption="Event Channel 3 output to pin" name="3" value="0x03"/>
      </value-group>
    </module>
    <module name="AES" id="I6096" caption="AES Module">
      <register-group caption="AES Module" name="AES" size="5">
        <register caption="AES Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Start/Run" mask="0x80" name="START"/>
          <bitfield caption="Auto Start Trigger" mask="0x40" name="AUTO"/>
          <bitfield caption="AES Software Reset" mask="0x20" name="RESET"/>
          <bitfield caption="Decryption / Direction" mask="0x10" name="DECRYPT"/>
          <bitfield caption="State XOR Load Enable" mask="0x04" name="XOR"/>
        </register>
        <register caption="AES Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="AES Error" mask="0x80" name="ERROR"/>
          <bitfield caption="State Ready Interrupt Flag" mask="0x01" name="SRIF"/>
        </register>
