avr-rust/avrd/packs/xmegab/ATxmega128B1.atdf
      <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
        <value caption="1.6 V" name="1V6" value="0x07"/>
        <value caption="1.8 V" name="1V8" value="0x06"/>
        <value caption="2.0 V" name="2V0" value="0x05"/>
        <value caption="2.2 V" name="2V2" value="0x04"/>
        <value caption="2.4 V" name="2V4" value="0x03"/>
        <value caption="2.6 V" name="2V6" value="0x02"/>
        <value caption="2.8 V" name="2V8" value="0x01"/>
        <value caption="3.0 V" name="3V0" value="0x00"/>
      </value-group>
    </module>
    <module name="LOCKBIT" id="I6570" version="XMEGAAU" caption="Fuses and Lockbits">
      <register-group caption="Lock Bits" name="NVM_LOCKBITS">
        <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1">
          <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="FUSE_BLBB"/>
          <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="FUSE_BLBA"/>
          <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="FUSE_BLBAT"/>
          <bitfield caption="Lock Bits" mask="0x03" name="LB" values="FUSE_LB"/>
        </register>
      </register-group>
      <value-group caption="Boot lock bits - boot setcion" name="FUSE_BLBB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application section" name="FUSE_BLBA">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application table section" name="FUSE_BLBAT">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Lock bits" name="FUSE_LB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
    </module>
    <module name="SIGROW" id="I3600" version="XMEGAB" caption="Signature Row">
      <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="72">
        <register caption="RCOSC 2 MHz Calibration Value B" name="RCOSC2M" offset="0x00" size="1"/>
        <register caption="RCOSC 2 MHz Calibration Value A" name="RCOSC2MA" offset="0x01" size="1"/>
        <register caption="RCOSC 32.768 kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
        <register caption="RCOSC 32 MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
        <register caption="RCOSC 32 MHz Calibration Value A" name="RCOSC32MA" offset="0x04" size="1"/>
        <register caption="Lot Number Byte 0, ASCII" name="LOTNUM0" offset="0x08" size="1"/>
        <register caption="Lot Number Byte 1, ASCII" name="LOTNUM1" offset="0x09" size="1"/>
        <register caption="Lot Number Byte 2, ASCII" name="LOTNUM2" offset="0x0A" size="1"/>
        <register caption="Lot Number Byte 3, ASCII" name="LOTNUM3" offset="0x0B" size="1"/>
        <register caption="Lot Number Byte 4, ASCII" name="LOTNUM4" offset="0x0C" size="1"/>
        <register caption="Lot Number Byte 5, ASCII" name="LOTNUM5" offset="0x0D" size="1"/>
        <register caption="Wafer Number" name="WAFNUM" offset="0x10" size="1"/>
        <register caption="Wafer Coordinate X Byte 0" name="COORDX0" offset="0x12" size="1"/>
        <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
        <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
        <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
        <register caption="USB Calibration Byte 0" name="USBCAL0" offset="0x1A" size="1"/>
        <register caption="USB Calibration Byte 1" name="USBCAL1" offset="0x1B" size="1"/>
        <register caption="USB RCOSC Calibration Value B" name="USBRCOSC" offset="0x1C" size="1"/>
        <register caption="USB RCOSC Calibration Value A" name="USBRCOSCA" offset="0x1D" size="1"/>
        <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
        <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
        <register caption="ADCB Calibration Byte 0" name="ADCBCAL0" offset="0x24" size="1"/>
        <register caption="ADCB Calibration Byte 1" name="ADCBCAL1" offset="0x25" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
        <register caption="Temperature Sensor Calibration Byte 1" name="TEMPSENSE1" offset="0x2F" size="1"/>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFP_100">
      <pin pad="GND" position="1"/>
      <pin pad="PC0" position="2"/>
      <pin pad="PC1" position="3"/>
      <pin pad="PC2" position="4"/>
      <pin pad="PC3" position="5"/>
      <pin pad="PC4" position="6"/>
      <pin pad="PC5" position="7"/>
      <pin pad="PC6" position="8"/>
      <pin pad="PC7" position="9"/>
      <pin pad="GND" position="10"/>
      <pin pad="VCC" position="11"/>
      <pin pad="PD0" position="12"/>
      <pin pad="PD1" position="13"/>
      <pin pad="PD2" position="14"/>
      <pin pad="RESET" position="15"/>
      <pin pad="PDI" position="16"/>
      <pin pad="GND" position="17"/>
      <pin pad="VCC" position="18"/>
      <pin pad="PE0" position="19"/>
      <pin pad="PE1" position="20"/>
      <pin pad="PE2" position="21"/>
      <pin pad="PE3" position="22"/>
      <pin pad="PE4" position="23"/>
      <pin pad="PE5" position="24"/>
      <pin pad="PE6" position="25"/>
      <pin pad="PE7" position="26"/>
      <pin pad="GND" position="27"/>
      <pin pad="VCC" position="28"/>
      <pin pad="PG0" position="29"/>
      <pin pad="PG1" position="30"/>
      <pin pad="PG2" position="31"/>
      <pin pad="PG3" position="32"/>
      <pin pad="PG4" position="33"/>
      <pin pad="PG5" position="34"/>
      <pin pad="PG6" position="35"/>
      <pin pad="PG7" position="36"/>
      <pin pad="PM0" position="37"/>
      <pin pad="PM1" position="38"/>
      <pin pad="PM2" position="39"/>
      <pin pad="PM3" position="40"/>
      <pin pad="PM4" position="41"/>
      <pin pad="PM5" position="42"/>
      <pin pad="PM6" position="43"/>
      <pin pad="PM7" position="44"/>
      <pin pad="SEG23" position="45"/>
      <pin pad="SEG22" position="46"/>
      <pin pad="SEG21" position="47"/>
      <pin pad="SEG20" position="48"/>
      <pin pad="SEG19" position="49"/>
      <pin pad="SEG18" position="50"/>
      <pin pad="SEG17" position="51"/>
      <pin pad="SEG16" position="52"/>
      <pin pad="SEG15" position="53"/>
      <pin pad="SEG14" position="54"/>
      <pin pad="SEG13" position="55"/>
      <pin pad="SEG12" position="56"/>
      <pin pad="SEG11" position="57"/>
      <pin pad="SEG10" position="58"/>
      <pin pad="SEG9" position="59"/>
      <pin pad="SEG8" position="60"/>
      <pin pad="SEG7" position="61"/>
      <pin pad="SEG6" position="62"/>
      <pin pad="SEG5" position="63"/>
      <pin pad="SEG4" position="64"/>
      <pin pad="SEG3" position="65"/>
      <pin pad="SEG2" position="66"/>
      <pin pad="SEG1" position="67"/>
      <pin pad="SEG0" position="68"/>
      <pin pad="GND" position="69"/>
      <pin pad="VCC" position="70"/>
      <pin pad="BIAS1" position="71"/>
      <pin pad="BIAS2" position="72"/>
      <pin pad="VLCD" position="73"/>
      <pin pad="CAPL" position="74"/>
      <pin pad="CAPH" position="75"/>
      <pin pad="COM0" position="76"/>
      <pin pad="COM1" position="77"/>
      <pin pad="COM2" position="78"/>
      <pin pad="COM3" position="79"/>
      <pin pad="PR0" position="80"/>
      <pin pad="PR1" position="81"/>
      <pin pad="PA0" position="82"/>
      <pin pad="PA1" position="83"/>
      <pin pad="PA2" position="84"/>
      <pin pad="PA3" position="85"/>
      <pin pad="PA4" position="86"/>
      <pin pad="PA5" position="87"/>
      <pin pad="PA6" position="88"/>
      <pin pad="PA7" position="89"/>
      <pin pad="AGND" position="90"/>
      <pin pad="AVCC" position="91"/>
      <pin pad="PB0" position="92"/>
      <pin pad="PB1" position="93"/>
      <pin pad="PB2" position="94"/>
      <pin pad="PB3" position="95"/>
      <pin pad="PB4" position="96"/>
      <pin pad="PB5" position="97"/>
      <pin pad="PB6" position="98"/>
      <pin pad="PB7" position="99"/>
      <pin pad="GND" position="100"/>
    </pinout>
    <pinout name="BGA_100">
      <pin pad="PC0" position="A1"/>
      <pin pad="VCC" position="A2"/>
      <pin pad="PB6" position="A3"/>
      <pin pad="PB2" position="A4"/>
      <pin pad="AVCC" position="A5"/>
      <pin pad="PA5" position="A6"/>
      <pin pad="PA1" position="A7"/>
      <pin pad="PR1" position="A8"/>
      <pin pad="COM2" position="A9"/>
      <pin pad="CAPH" position="A10"/>
      <pin pad="PC3" position="B1"/>
      <pin pad="GND" position="B2"/>
      <pin pad="PB7" position="B3"/>
      <pin pad="PB4" position="B4"/>
      <pin pad="AGND" position="B5"/>
      <pin pad="PA4" position="B6"/>
      <pin pad="PA0" position="B7"/>
      <pin pad="PR0" position="B8"/>
      <pin pad="COM1" position="B9"/>
      <pin pad="CAPL" position="B10"/>
      <pin pad="PC5" position="C1"/>
      <pin pad="PC4" position="C2"/>
      <pin pad="PC1" position="C3"/>
      <pin pad="PB5" position="C4"/>
      <pin pad="PA7" position="C5"/>
      <pin pad="PA3" position="C6"/>
      <pin pad="COM3" position="C7"/>
      <pin pad="COM0" position="C8"/>
      <pin pad="BIAS2" position="C9"/>
      <pin pad="BIAS1" position="C10"/>
      <pin pad="VCC" position="D1"/>
      <pin pad="GND" position="D2"/>
      <pin pad="PD0" position="D3"/>
      <pin pad="PC2" position="D4"/>
      <pin pad="PB0" position="D5"/>
      <pin pad="PA6" position="D6"/>
      <pin pad="SEG0" position="D7"/>
      <pin pad="VLCD" position="D8"/>
      <pin pad="GND" position="D9"/>
      <pin pad="VCC" position="D10"/>
      <pin pad="PD2" position="E1"/>
      <pin pad="RESET" position="E2"/>
      <pin pad="PD1" position="E3"/>
      <pin pad="PC6" position="E4"/>
      <pin pad="PB1" position="E5"/>
      <pin pad="PA2" position="E6"/>
      <pin pad="SEG1" position="E7"/>
      <pin pad="SEG4" position="E8"/>
      <pin pad="SEG3" position="E9"/>
      <pin pad="SEG2" position="E10"/>
      <pin pad="VCC" position="F1"/>
      <pin pad="GND" position="F2"/>
      <pin pad="PDI" position="F3"/>
      <pin pad="PC7" position="F4"/>
      <pin pad="PB3" position="F5"/>
      <pin pad="PM2" position="F6"/>
      <pin pad="SEG10" position="F7"/>
      <pin pad="SEG7" position="F8"/>
      <pin pad="SEG6" position="F9"/>
      <pin pad="SEG5" position="F10"/>
      <pin pad="PE2" position="G1"/>
      <pin pad="PE1" position="G2"/>
      <pin pad="PE3" position="G3"/>
      <pin pad="PE0" position="G4"/>
      <pin pad="PE4" position="G5"/>
      <pin pad="SEG23" position="G6"/>
      <pin pad="SEG15" position="G7"/>
      <pin pad="SEG13" position="G8"/>
      <pin pad="SEG9" position="G9"/>
      <pin pad="SEG8" position="G10"/>
      <pin pad="PE5" position="H1"/>
      <pin pad="PE6" position="H2"/>
      <pin pad="PG1" position="H3"/>
      <pin pad="PG4" position="H4"/>
      <pin pad="PG7" position="H5"/>
      <pin pad="PM5" position="H6"/>
      <pin pad="SEG21" position="H7"/>
      <pin pad="SEG18" position="H8"/>
      <pin pad="SEG12" position="H9"/>
      <pin pad="SEG11" position="H10"/>
      <pin pad="PE7" position="J1"/>
      <pin pad="PG0" position="J2"/>
      <pin pad="PG3" position="J3"/>
      <pin pad="PG6" position="J4"/>
      <pin pad="PM1" position="J5"/>
      <pin pad="PM4" position="J6"/>
      <pin pad="PM7" position="J7"/>
      <pin pad="SEG20" position="J8"/>
      <pin pad="SEG16" position="J9"/>
      <pin pad="SEG14" position="J10"/>
      <pin pad="GND" position="K1"/>
      <pin pad="VCC" position="K2"/>
      <pin pad="PG2" position="K3"/>
      <pin pad="PG5" position="K4"/>
      <pin pad="PM0" position="K5"/>
      <pin pad="PM3" position="K6"/>
      <pin pad="PM6" position="K7"/>
      <pin pad="SEG22" position="K8"/>
      <pin pad="SEG19" position="K9"/>
      <pin pad="SEG17" position="K10"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
